{
  "backend/main.mo": "Empty Motoko actor with no exposed methods.",
  "feature_evidence.json": "Feature evidence report describing a footer link change in SiteFooter.tsx.",
  "frontend-file-summaries.txt": "JSON-style list summarizing all major frontend files and components.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and dark mode tokens.",
  "frontend/index.html": "Main HTML entry including SEO meta tags, favicon, and root mounting point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all pages under SiteLayout.",
  "frontend/src/components/SiteFooter.tsx": "Footer with navigation links and attribution linking to webzio.caffeine.app.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper including TopNav, main content, and SiteFooter.",
  "frontend/src/components/TopNav.tsx": "Responsive navigation bar with Webzio logo, desktop menu, and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and refreshes backend actors based on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future backend query hooks.",
  "frontend/src/hooks/useSeo.ts": "Hook that updates document title and meta description for SEO.",
  "frontend/src/index.css": "Tailwind global styles with color tokens, dark mode variants, and typography tweaks.",
  "frontend/src/lib/instantPriceCalculatorPricing.ts": "Pricing matrix and helper functions for estimating service costs.",
  "frontend/src/main.tsx": "App bootstrap that initializes React Query, Internet Identity, and renders App.",
  "frontend/src/pages/About.tsx": "Renders the About page with SEO metadata and a short description of Webzio’s mission.",
  "frontend/src/pages/Contact.tsx": "Displays contact details, WhatsApp link, online-service note, and terms and conditions with SEO setup.",
  "frontend/src/pages/Home.tsx": "Shows the homepage hero, highlights, and intro text with navigation and SEO configuration.",
  "frontend/src/pages/InstantPriceCalculator.tsx": "Provides an instant price calculator using dropdowns for service type and work level, with SEO metadata.",
  "frontend/src/pages/Services.tsx": "Lists available services, pricing notes, and a simple three-step process, including SEO setup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "JSON file storing project state, features, and metadata for the site attribution link update."
}