{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light and dark themes.",
  "frontend/index.html": "HTML entry point containing root div, title, and Google Search Console verification.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all site pages including Instant Price Calculator wrapped in SiteLayout.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with navigation links and caffeine.ai attribution.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper providing TopNav, content area, and SiteFooter.",
  "frontend/src/components/TopNav.tsx": "Responsive navigation bar with active-link highlighting and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity login, state, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future React Query hooks.",
  "frontend/src/hooks/useSeo.ts": "Hook for updating document title and meta description.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global styles for layout and typography.",
  "frontend/src/lib/instantPriceCalculatorPricing.ts": "Provides a pricing matrix for services and a function to calculate estimated prices based on service type and work level.",
  "frontend/src/main.tsx": "Bootstraps the React app using ReactDOM, setting up React Query and the Internet Identity provider.",
  "frontend/src/pages/About.tsx": "Renders the About page with SEO metadata and a description of the Digital Pro Hub initiative.",
  "frontend/src/pages/Contact.tsx": "Displays contact information, WhatsApp link, online service note, and terms and conditions with SEO metadata.",
  "frontend/src/pages/Home.tsx": "Shows the home page with hero content, highlights, and navigation options, including SEO metadata.",
  "frontend/src/pages/InstantPriceCalculator.tsx": "Implements a UI for selecting service and work level to display an estimated price using the pricing utility.",
  "frontend/src/pages/Services.tsx": "Lists available services, pricing notes, and a step-by-step workflow, with associated SEO metadata.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom theme extensions, animations, and plugin setup.",
  "project_state.json": "Defines the project’s current state, features, and metadata for a multi-page marketing site using ICP, React, and Motoko."
}